[
  {
    "name": "Banana Man Tee",
    "slug": "banana-man-tee",
    "description": "Premium streetwear tee featuring the iconic Banana Man character. This isn't just a t-shirt—it's a statement. Born from the concrete jungle where dreams meet reality, each thread tells a story of resilience. 100% organic cotton, crafted for those who refuse to blend in. The Banana Man represents the everyday hero, the one who stands tall even when the world tries to peel them down. Wear your story. Wear your hood. This limited edition piece features urban fruit energy designed for the streets, by the streets.",
    "descriptionEN": "Premium streetwear tee featuring the iconic Banana Man character. This isn't just a t-shirt—it's a statement. Born from the concrete jungle where dreams meet reality, each thread tells a story of resilience. 100% organic cotton, crafted for those who refuse to blend in.",
    "priceEUR": 39.99,
    "pricePLN": 169.99,
    "printfulVariantId": "variant_test_banana_tee",
    "imageUrl": "https://images.unsplash.com/photo-1521572163474-6864f9cf17ab?w=800&h=800&fit=crop",
    "is_limited": false,
    "stock": 100,
    "category": "t-shirts",
    "tags": ["urban", "streetwear", "banana-man", "casual"],
    "materials": ["100% Organic Cotton", "GSM 180"],
    "sizes": ["S", "M", "L", "XL", "XXL"],
    "colors": ["Black", "White", "Navy"],
    "story": "The Banana Man emerged from late-night sessions in the studio, a symbol of the artist who stays golden even when things get rough. Inspired by the resilience of street culture and the sweetness found in struggle."
  },
  {
    "name": "Strawberry Revolution Hoodie",
    "slug": "strawberry-revolution-hoodie",
    "description": "Unisex hoodie celebrating fruit rebellion. When strawberries rise, the system falls. Soft fleece lining, rebellious spirit. This heavyweight hoodie carries the fire of change. Designed for those who refuse to accept the status quo, each stitch is a thread of resistance. Wear the revolution on your back, feel the weight of authenticity. The strawberry doesn't ask for permission—it takes what's theirs. Made for the warriors, the dreamers, the ones who know that sweetness comes from struggle. Limited edition—when it's gone, it's gone.",
    "descriptionEN": "Unisex hoodie celebrating fruit rebellion. Soft fleece lining, rebellious spirit. Designed for those who refuse to accept the status quo. Limited edition heavyweight hoodie made for the warriors and dreamers.",
    "priceEUR": 69.99,
    "pricePLN": 299.99,
    "printfulVariantId": "variant_test_strawberry_hoodie",
    "imageUrl": "https://images.unsplash.com/photo-1556821840-3a63f95609a7?w=800&h=800&fit=crop",
    "is_limited": true,
    "stock": 50,
    "category": "hoodies",
    "tags": ["revolution", "limited", "hoodie", "rebellion"],
    "materials": ["80% Cotton", "20% Polyester", "GSM 400"],
    "sizes": ["S", "M", "L", "XL", "XXL"],
    "colors": ["Black", "Red", "Charcoal"],
    "story": "Born from the streets, made for the revolution. The Strawberry Revolution Hoodie represents the power of collective action—sweet, sharp, and unapologetic. Inspired by moments when communities come together to demand change."
  },
  {
    "name": "Urban Mango Snapback",
    "slug": "urban-mango-snapback",
    "description": "Adjustable snapback cap with embroidered mango design. Perfect for the hustler lifestyle. This isn't just a cap—it's a crown for the street royalty. The mango, golden and bold, represents the sweetness earned through hustle. Each stitch honors the grind, the late nights, the early mornings. Adjustable fit for every head, every dream, every story. Wear it backward, forward, sideways—express yourself. Made for those who understand that success tastes like victory after the struggle.",
    "descriptionEN": "Adjustable snapback cap with embroidered mango design. Perfect for the hustler lifestyle. The mango represents the sweetness earned through hustle. Adjustable fit for every head, every dream.",
    "priceEUR": 29.99,
    "pricePLN": 129.99,
    "printfulVariantId": "variant_test_mango_cap",
    "imageUrl": "https://images.unsplash.com/photo-1588850561407-ed78c282e89b?w=800&h=800&fit=crop",
    "is_limited": false,
    "stock": 200,
    "category": "caps",
    "tags": ["snapback", "mango", "urban", "hustle"],
    "materials": ["100% Cotton Twill", "Adjustable Snapback"],
    "sizes": ["One Size"],
    "colors": ["Black", "Navy", "Tan"],
    "story": "The mango snapback is for the hustler who knows their worth. Golden opportunities, golden moments—earned through dedication. Every morning you put this on, you're declaring your intent to shine."
  },
  {
    "name": "Grape Gang Sweatpants",
    "slug": "grape-gang-sweatpants",
    "description": "Comfortable sweatpants for the crew. Elastic waist, deep pockets, gang-approved design. When the crew moves, we move together. These aren't just pants—they're a uniform for the committed. Soft, durable, designed for the long nights and the longer conversations. The Grape Gang represents unity, the power of the collective. Wear them to the studio, the block, the journey. Every step is a statement. Every pocket holds a dream. Made for comfort, built for style, designed for life.",
    "descriptionEN": "Comfortable sweatpants for the crew. Elastic waist, deep pockets, gang-approved design. Soft, durable, designed for the long nights. Made for comfort, built for style, designed for life.",
    "priceEUR": 54.99,
    "pricePLN": 239.99,
    "printfulVariantId": "variant_test_grape_pants",
    "imageUrl": "https://images.unsplash.com/photo-1542272604-787c3835535d?w=800&h=800&fit=crop",
    "is_limited": false,
    "stock": 75,
    "category": "pants",
    "tags": ["sweatpants", "crew", "comfort", "streetwear"],
    "materials": ["80% Cotton", "20% Polyester", "Fleece Lining"],
    "sizes": ["S", "M", "L", "XL", "XXL"],
    "colors": ["Black", "Grey", "Navy"],
    "story": "The Grape Gang Sweatpants celebrate the crew mentality—individual grapes that come together to create something powerful. Unity in comfort, strength in numbers."
  },
  {
    "name": "Orange Dreams Poster",
    "slug": "orange-dreams-poster",
    "description": "Limited edition screen-printed poster, 18x24 inches. Signed by the artist. Piece of FFDH history. Orange Dreams captures that moment between sunset and streetlights, when the city glows and anything feels possible. This isn't just art—it's a window into the dreams that drive us. Each poster is hand-signed, numbered, and authentic. Hang it in your space, let it remind you that dreams are valid. Limited to 100 pieces worldwide. When they're gone, they're gone forever.",
    "descriptionEN": "Limited edition screen-printed poster, 18x24 inches. Signed by the artist. Orange Dreams captures that moment between sunset and streetlights. Each poster is hand-signed, numbered, and authentic. Limited to 100 pieces worldwide.",
    "priceEUR": 24.99,
    "pricePLN": 109.99,
    "printfulVariantId": "variant_test_poster_orange",
    "imageUrl": "https://images.unsplash.com/photo-1541961017774-22349e4a1262?w=800&h=800&fit=crop",
    "is_limited": true,
    "stock": 30,
    "category": "posters",
    "tags": ["poster", "art", "limited", "signed"],
    "materials": ["Premium Paper", "Screen-Printed"],
    "sizes": ["18x24 inches"],
    "colors": ["Full Color"],
    "story": "Orange Dreams is about that golden hour when the impossible feels reachable. The moment before you take the leap. The second before the dream becomes reality. This poster captures that energy."
  },
  {
    "name": "Pineapple Power Tank",
    "slug": "pineapple-power-tank",
    "description": "Muscle tank celebrating tropical strength. When life gives you concrete, you make it gold. The Pineapple Power Tank is for those who know their worth and aren't afraid to show it. Tough exterior, sweet interior—just like the fruit, just like the streets. Perfect for the gym, the block, or anywhere you need to show your strength. Breathable fabric keeps you cool when the heat is on. This is for the warriors who train in the sun, who grind in the heat, who shine when others fade.",
    "descriptionEN": "Muscle tank celebrating tropical strength. The Pineapple Power Tank is for those who know their worth. Breathable fabric keeps you cool when the heat is on. Perfect for the gym, the block, or anywhere you need to show your strength.",
    "priceEUR": 34.99,
    "pricePLN": 149.99,
    "printfulVariantId": "variant_test_pineapple_tank",
    "imageUrl": "https://images.unsplash.com/photo-1521223890158-f9f7c3d5d504?w=800&h=800&fit=crop",
    "is_limited": false,
    "stock": 120,
    "category": "tanks",
    "tags": ["tank", "gym", "strength", "tropical"],
    "materials": ["100% Cotton", "Moisture-Wicking"],
    "sizes": ["S", "M", "L", "XL"],
    "colors": ["Black", "White", "Neon Green"],
    "story": "Pineapple Power represents the warrior spirit—tough on the outside, sweet on the inside. Built for those who grind and shine."
  },
  {
    "name": "Apple Core Beanie",
    "slug": "apple-core-beanie",
    "description": "Cozy beanie for the winter warriors. Keep your head warm, keep your dreams alive. The Apple Core Beanie wraps you in comfort while you navigate the cold streets. Simple, essential, authentic. This isn't about fashion—it's about survival. It's about staying warm while you chase your dreams through the seasons. Made for those who understand that style is function, that warmth is luxury, that every piece matters when you're building from nothing.",
    "descriptionEN": "Cozy beanie for the winter warriors. Keep your head warm, keep your dreams alive. Simple, essential, authentic. Made for those who understand that style is function, that warmth is luxury.",
    "priceEUR": 19.99,
    "pricePLN": 89.99,
    "printfulVariantId": "variant_test_apple_beanie",
    "imageUrl": "https://images.unsplash.com/photo-1521369909029-2afed882baee?w=800&h=800&fit=crop",
    "is_limited": false,
    "stock": 150,
    "category": "accessories",
    "tags": ["beanie", "winter", "warmth", "essential"],
    "materials": ["Acrylic Blend", "Stretch Fit"],
    "sizes": ["One Size"],
    "colors": ["Black", "Grey", "Red"],
    "story": "The Apple Core Beanie is essential gear for the dedicated. When the seasons change but the hustle doesn't, you need gear that keeps up. This is that gear."
  },
  {
    "name": "Cherry Bomb Jacket",
    "slug": "cherry-bomb-jacket",
    "description": "Bomber jacket that explodes with style. The Cherry Bomb Jacket is a statement piece—bold, unexpected, unforgettable. This isn't your average bomber. It's a work of art that happens to be clothing. Designed for those who aren't afraid to stand out, who know that impact matters. Premium materials meet street sensibility. When you wear this, you're not just wearing a jacket—you're wearing confidence. Limited edition design that turns heads and starts conversations. This is for the bold, the brave, the ones who understand that style is rebellion.",
    "descriptionEN": "Bomber jacket that explodes with style. The Cherry Bomb Jacket is a statement piece—bold, unexpected, unforgettable. Premium materials meet street sensibility. Limited edition design for the bold, the brave.",
    "priceEUR": 89.99,
    "pricePLN": 389.99,
    "printfulVariantId": "variant_test_cherry_jacket",
    "imageUrl": "https://images.unsplash.com/photo-1551028719-00167b16eac5?w=800&h=800&fit=crop",
    "is_limited": true,
    "stock": 40,
    "category": "jackets",
    "tags": ["bomber", "jacket", "limited", "statement"],
    "materials": ["Polyester Shell", "Cotton Lining", "Ribbed Cuffs"],
    "sizes": ["S", "M", "L", "XL"],
    "colors": ["Black", "Red", "Navy"],
    "story": "The Cherry Bomb Jacket is about making an entrance. When you walk in, they remember. When you leave, they wonder. This is for those who aren't here to blend in."
  },
  {
    "name": "Lemon Hustle Socks",
    "slug": "lemon-hustle-socks",
    "description": "Three-pack of premium crew socks. When life gives you lemons, you make them work. The Lemon Hustle Socks are for those who understand that every detail matters. Soft, comfortable, durable. These aren't just socks—they're the foundation of your fit. The hidden detail that shows you care about the whole picture. Perfect for everyday wear, gym sessions, or when you need that extra layer of confidence. Three pairs, three shades, one mission: comfort meets style.",
    "descriptionEN": "Three-pack of premium crew socks. Soft, comfortable, durable. Perfect for everyday wear, gym sessions, or when you need that extra layer of confidence. Three pairs, three shades, one mission: comfort meets style.",
    "priceEUR": 14.99,
    "pricePLN": 64.99,
    "printfulVariantId": "variant_test_lemon_socks",
    "imageUrl": "https://images.unsplash.com/photo-1586350977773-b3f7b80e40da?w=800&h=800&fit=crop",
    "is_limited": false,
    "stock": 300,
    "category": "accessories",
    "tags": ["socks", "three-pack", "comfort", "daily"],
    "materials": ["Cotton Blend", "Elastic Cuff"],
    "sizes": ["One Size"],
    "colors": ["Black", "White", "Grey"],
    "story": "Lemon Hustle Socks celebrate the details that matter. The foundation that supports the whole fit. Small things, big impact."
  },
  {
    "name": "Peach Dreams Crewneck",
    "slug": "peach-dreams-crewneck",
    "description": "Soft crewneck sweater for the dreamers. Peach Dreams is about soft moments, sweet thoughts, gentle ambition. This isn't aggressive—it's elegant. It's for those who move with intention, who dream with clarity, who understand that power can be quiet. Premium cotton blend feels like comfort, looks like confidence. Perfect for those days when you need to feel wrapped in possibility. The peach represents sweetness earned, dreams realized, moments cherished. Wear it when you're building, when you're dreaming, when you're becoming.",
    "descriptionEN": "Soft crewneck sweater for the dreamers. Peach Dreams is about soft moments, sweet thoughts, gentle ambition. Premium cotton blend feels like comfort, looks like confidence. Perfect for those days when you need to feel wrapped in possibility.",
    "priceEUR": 59.99,
    "pricePLN": 259.99,
    "printfulVariantId": "variant_test_peach_crewneck",
    "imageUrl": "https://images.unsplash.com/photo-1576566588028-4147f3842f27?w=800&h=800&fit=crop",
    "is_limited": false,
    "stock": 80,
    "category": "sweaters",
    "tags": ["crewneck", "dreams", "soft", "elegant"],
    "materials": ["70% Cotton", "30% Polyester"],
    "sizes": ["S", "M", "L", "XL", "XXL"],
    "colors": ["Peach", "Cream", "Grey"],
    "story": "Peach Dreams is for the gentle warriors—those who understand that strength can be soft, that ambition can be kind, that dreams deserve to be worn proudly."
  },
  {
    "name": "Watermelon Wave Shorts",
    "slug": "watermelon-wave-shorts",
    "description": "Board shorts for the summer vibe. Watermelon Wave Shorts are for those who understand that life is better by the water—whether that's the beach, the pool, or just the energy of summer. Quick-dry fabric means you're ready for whatever comes next. The watermelon pattern isn't just decoration—it's a mood. It's the energy of summer nights, the sweetness of perfect moments, the refreshment of cold water on hot days. These aren't just shorts—they're a lifestyle. Perfect for beach days, pool parties, or when you just need to feel that summer energy all year round.",
    "descriptionEN": "Board shorts for the summer vibe. Watermelon Wave Shorts are for those who understand that life is better by the water. Quick-dry fabric means you're ready for whatever comes next. Perfect for beach days, pool parties, or when you just need to feel that summer energy.",
    "priceEUR": 44.99,
    "pricePLN": 194.99,
    "printfulVariantId": "variant_test_watermelon_shorts",
    "imageUrl": "https://images.unsplash.com/photo-1596755389373-c31a21b64373?w=800&h=800&fit=crop",
    "is_limited": false,
    "stock": 90,
    "category": "shorts",
    "tags": ["shorts", "summer", "swim", "vibes"],
    "materials": ["100% Polyester", "Quick-Dry"],
    "sizes": ["S", "M", "L", "XL"],
    "colors": ["Watermelon Print", "Navy", "Black"],
    "story": "Watermelon Wave Shorts capture that perfect summer moment—when everything feels possible, when the days are long, and when life tastes like refreshment."
  },
  {
    "name": "Kiwi Kicks Backpack",
    "slug": "kiwi-kicks-backpack",
    "description": "Functional backpack for the daily grind. The Kiwi Kicks Backpack is for those who carry their dreams with them everywhere. This isn't just storage—it's a mobile base of operations. Multiple pockets for organization, padded laptop compartment for your tech, water-resistant material for when life gets messy. The kiwi represents adaptability—thriving in different environments, staying fresh under pressure. This backpack is for students, creators, hustlers—anyone who understands that your gear should support your mission. Built to last, designed to perform, made for the journey.",
    "descriptionEN": "Functional backpack for the daily grind. Multiple pockets for organization, padded laptop compartment for your tech, water-resistant material for when life gets messy. Built to last, designed to perform, made for the journey.",
    "priceEUR": 49.99,
    "pricePLN": 219.99,
    "printfulVariantId": "variant_test_kiwi_backpack",
    "imageUrl": "https://images.unsplash.com/photo-1553062407-98eeb64c6a62?w=800&h=800&fit=crop",
    "is_limited": false,
    "stock": 60,
    "category": "bags",
    "tags": ["backpack", "functional", "daily", "gear"],
    "materials": ["Polyester", "Nylon Lining", "Zipper Closures"],
    "sizes": ["One Size"],
    "colors": ["Black", "Green", "Navy"],
    "story": "The Kiwi Kicks Backpack is for those who understand that your tools should match your ambition. Carry your dreams, protect your hustle, stay organized and ready."
  }
]

